;;
;; @author naoiwata
;; SICP Chapter3
;; Exercise 3.44.
;;

; ------------------------------------------------------------------------
; question
; ------------------------------------------------------------------------

(define (transfer from-account to-account amount)
  ((from-account 'withdraw) amount)
  ((to-account 'deposit) amount))

; ------------------------------------------------------------------------
; discussion
; ------------------------------------------------------------------------

; Louis は誤りであり Ben の考察が正しい. 
; serialized-exchange 手続きは各々の手続きを直列化して順に処理を行い口座の金額の総和を一定に保っている. 
; Ben が考える transfer 手続きも, 処理の手順は違うが withdraw と deposit 手続きを直列化して順に処理を
; 行っているので同様の振る舞いをすると考えられるからである.

; END