;
; @author naoiwata
; scheme
; http://www.shido.info/lisp/scheme2.html
;

; (1)
; 1. (1+39) * (53-45)
(* (+ 1 39) (- 53 45))

; 2. (1020 / 39) + (45 * 2)
(+ (/ 1020 39) (* 45 2))

; 3. 39, 48, 72, 23, 91 の合計
(+ 39 48 72 23 91)

; 4. 39, 48, 72, 23, 91 の平均を小数で。
(exact->inexact (/ (+ 39 48 72 23 91) 5))

; (2)
; 1. 円周率 π
; tan(π / 4) = sin(π / 4) / cos(π / 4) = 1
; が成り立つので逆数は、
; atan(1) = π / 4
; π = atan(1) * 4
(* (atan 1) 4)
; 3.141592653589793

; 2. exp(2/3)
(exp (/ 2 3))

; 3. 3 の 4 乗
(expt 3 4)

; 4. 1000 の自然対数
(log 1000)